# Лабораторная работа №1. HTTP
[**Ссылка на условие на GitHub**](https://github.com/MSU-Courses/advanced-web-development/tree/main/_lab)

## Цель работы
Понять, что происходит, когда пользователь открывает сайт.
Научиться находить и анализировать HTTP-запросы в браузере.
Разобраться в назначении методов GET, POST, PUT, DELETE.

## Задание 1. Анализ HTTP-запросов. Часть 1
1. Откройте сайт Wikipedia: https://en.wikipedia.org/wiki/HTTP
2. Прочитайте статью и обратите внимание на разделы, посвященные HTTP-запросам.
3. Откройте инструменты разработчика в вашем браузере (обычно это можно сделать, нажав F12 или правой кнопкой мыши выбрав "Inspect").
4. Перейдите на вкладку "Network" (Сеть).
5. Обновите страницу Wikipedia.
![img.png](assets/img.png)
6. Найдите первый запрос к странице, он будет назван как HTTP и изучите следующие аспекты:
    * URL запроса - https://en.wikipedia.org/wiki/HTTP
    * Метод запроса. Используется GET метод, так как именно с помощью него мы обращаемся к серверу для чтения данных  
    * Статус ответа. Что означает статус ответа? Успешный ли ответ пришел с сервера или нет(если 200-299 успешный, 400-499 - ошибка на стороне клиента, 500-599 ошибка на стороне сервера)
    * Заголовки запроса и ответа. Какие заголовки присутствуют и какую информацию они содержат? 
   ![img_1.png](assets/img_1.png) Они содержат служебную информацию,такую как User-Agent(прикидываемся браузером(юзером)),Куки,Referer(откуда мы пришли по этому url),
   Кодировки,Локализации,Пути и тд для **Заголовков запроса** и Кодировки,Размер контента,Язык,Кастомные заголовки,Тип ответа(жсон или хтмл к примеру),
   Дата,Сервер ответа и тд для **Заголовков ответа**
    * Есть ли тело запроса или ответа? Если да, то что в нем содержится?
   Тело запроса отсутсвует(так как у get нет его,просто читаем),Тело ответа есть(Content Type), в нем содержится ответ от сервера в нашем случае в формате текста хтмл и кодировка utf-8
7. Какие еще запросы были отправлены при загрузке страницы и почему? В добавок к гету были отправлены такие запросы как стили,изображения,модули и тд,которые догружаются веб-страницой
8. Сделайте скриншот с информацией о запросе и сохраните его.
![img_2.png](assets/img_2.png)
9. Перейдите по следующему адресу: https://en.wikipedia.org/wiki/HTTPdsfdfs и повторите анализ для этого запроса. Какой статус ответа вы получили и почему?
![img_3.png](assets/img_3.png)
У нас запрос упал с ошибкой 404, которая подразумевает не ошибку сервера,а ошибку клиента(Not found), мы ввели несуществующий рут и получили ошибку

## Задание 2. Анализ HTTP-запросов. Часть 2
1. Перейдите на: https://en.wikipedia.org/wiki/Special:Search
2. Выполните поиск по слову browser (Пример).
![img_4.png](assets/img_4.png)
3. Найдите запрос поиска в Network.
Изучите следующие аспекты:
   * URL запроса. Какой URL используется для выполнения поиска? Изучив все запросы,догадываюсь,что url с файлом php, потому что остальное это то, что он подгружает сам(модули,стили и тд)
   ![img_5.png](assets/img_5.png)
   * Метод запроса. Почему используется именно этот метод? Используется GET, так как мы читаем веб-страницу с сервера,мы выполняем поиск и по определенному эндпоинту(руту) он через гет на бэке возвращает страничку
   * Query Parameters. Какие параметры передаются в запросе, что они означают и для чего используются?
   Так как у нас гет запрос,то параметры передаются прямо в ссылке(если нужно добавить что-то по типу post, то в теле запроса передается)
   Параметра идут после хоста(после ?),дальше идет search=Browser или pathvariable(то что ввел юзер и передается как параметр на бэке к бд),
   title=Special 3ASearch(служебная информация, показывающая на какой страничке делать поиск),
   profile=advanced&fulltext=1&ns0=1(донастройка к запросу,полнотекстовый поиск,игнорируя определенные шаблоны(расширенный поиск))
   ![img_6.png](assets/img_6.png)

## Задание 3. Анализ HTTP-запросов. Часть 3
1. Повторите анализ HTTP-запроса для одного сайта на выбор:
[GitHub](https://github.com)![img_7.png](assets/img_7.png)

В данном случае используется опять же GET запрос со статусом кода 200, значит сервер успешно вернул нам страничку, которая подгрузила оставшиеся скрипты js,фотки и тд,
также remote adress(последний узел с которого был произведен запрос на сервер), политика referrer(чтобы данные не заполнялись или заполнялись браузером), 

**Request Headers:** кэш-контрол для проверки актуальности файла, куки,referrer(откуда мы пришли на сайт), в каком формате и языке мы отправляем данные на сервер, 
юзер-агент и тд,

**Response Headers:** кодировка, локализация(в какой кодировке и языке принимает с сервера данные), 
дата, полиитка безопасности, контент-тайп(какой формат ответа приходит с сервера,в данном случае html кодировки utf-8), 
куки и даже плюсом есть сервер, с которого приходят данные(server: github.com)

## Задание 4. Составление HTTP-запросов
1. Составьте GET-запрос к серверу по адресу http://sandbox.usm.com, указав в заголовке User-Agent ваше имя и фамилию.
![img_8.png](assets/img_8.png)

User-Agent используется в запросах, когд нужно стороннему api показать, что мы не бо или парсер, а браузер
2. Составьте POST-запрос к серверу по адресу http://sandbox.usm.com/cars, указав в теле запроса следующие параметры:

* make: марка автомобиля (например, "Toyota")
* model: модель автомобиля (например, "Corolla")
* year: год выпуска автомобиля (например, 2020)
![img_10.png](assets/img_10.png)

Тут будут параметры передаваться сразу в параметрах, существуют также самые привычные get,post,put,delete,head,connect,options,trace,patch.
Из самых используемых,таких как get,delete,put,head(они являются идемпотентными, то есть при повторном идентичном запросе, 
метод имеет один и тот же результат, не меняющий состояние сервера)

3. Составьте PUT-запрос к серверу по адресу http://sandbox.usm.com/cars/1, указав в заголовке User-Agent ваше имя и фамилию, в заголовке Content-Type значение application/json и в теле запроса следующие параметры:
![img_11.png](assets/img_11.png)
![img_12.png](assets/img_12.png)

PUT используется для полного обновления данных(если в бд или на бэке сущность, то он заменяет все данные, если не передать все параметры, он будет заменять их null)

PATCH используется для частичного обновления(можно передавать не все параметры, старые данные не будут тронуты)

4. Напишите один из возможных вариантов ответа сервера следующий запрос:
![img_13.png](assets/img_13.png)

Из возможных вариантов наш бэк через врапперы и дто обработает наш запрос post для добавления ресурса с параметрами: тойота,королла,2020,
добавит в бд и вернет обратно через request body какой-то ответ в виде json с успешным статусом кода 200.

201 - успешно создан ресурс,вернет айди созданного таска

400 - bad request, ошибка на клиенте(неверный формат и тд,например,валидация стоит на сервере и в объектах при валидации ошибка,то возвращает 400)

401 - ошибка аутентификация

403 - ошибка прав доступа клиента

404 - not found, ошибка на клиенте, неправильный запрос в виде рута или не найден айди в запросе

500 - ошибка на сервере, ошибка краша бд или разработчика, который глобальным хэндлером не обработал исключения нормально
